ARMmbed/mbed-os/targets/TARGET_Infineon/TARGET_XMC4XXX/xmc4_helper.c
/* mbed Microcontroller Library
 * Copyright (c) 2006-2015 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/***************************************************************** Includes **/
#include <stddef.h>
#include "xmc4_helper.h"
#include "xmc4_usic_map.h"

/************************************************* Pin function declaration **/

/**
 * P0_0
 */
static pin_io_function_t P0_0 = {
        .pin_nbr = 0,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = USIC1_C1_DX0_P0_0,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/*
 * P0_1
 */
static pin_io_function_t P0_1 = {
        .pin_nbr = 1,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/*
 * P0_2
 */
static pin_io_function_t P0_2 = {
        .pin_nbr = 2,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB3,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/*
 * P0_3
 */
static pin_io_function_t P0_3 = {
        .pin_nbr = 3,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xB0,
        .pwm_ccu8_channel = 1
};

/**
 * P0_4
 */
static pin_io_function_t P0_4 = {
        .pin_nbr = 4,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB3,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/*
 * P0_5
 */
static pin_io_function_t P0_5 = {
        .pin_nbr = 5,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_5,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xA0,
        .pwm_ccu8_channel = 1
};

/**
 * P0_6
 */
static pin_io_function_t P0_6 = {
        .pin_nbr = 6,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 0,
        .eru0_input    = 0xB2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P0_7
 */
static pin_io_function_t P0_7 = {
        .pin_nbr = 7,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB1,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P0_8
 */
static pin_io_function_t P0_8 = {
        .pin_nbr = 8,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA1,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P0_9
 */
static pin_io_function_t P0_9 = {
        .pin_nbr = 9,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P0_10
 */
static pin_io_function_t P0_10 = {
        .pin_nbr = 10,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 0,
        .eru0_input    = 0xA0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P0_11
 */
static pin_io_function_t P0_11 = {
        .pin_nbr = 11,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P0_12
 */
static pin_io_function_t P0_12 = {
        .pin_nbr = 12,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P0_13
 */
static pin_io_function_t P0_13 = {
        .pin_nbr = 13,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P0_14
 */
static pin_io_function_t P0_14 = {
        .pin_nbr = 14,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P0_15
 */
static pin_io_function_t P0_15 = {
        .pin_nbr = 15,
        .pin_port = 0,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P1_0
 */
static pin_io_function_t P1_0 = {
        .pin_nbr = 0,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_1
 */
static pin_io_function_t P1_1 = {
        .pin_nbr = 1,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_2
 */
static pin_io_function_t P1_2 = {
        .pin_nbr = 2,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xB0,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_3
 */
static pin_io_function_t P1_3 = {
        .pin_nbr = 3,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xA0,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_4
 */
static pin_io_function_t P1_4 = {
        .pin_nbr = 4,
        .pin_port = 1,
        .usic0_ch0_dx0 = USIC0_C0_DX0_P1_4,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB0,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

