ARMmbed/mbed-os/targets/TARGET_Infineon/TARGET_XMC4XXX/xmc4_helper.c
/*
 * P1_5
 */
static pin_io_function_t P1_5 = {
        .pin_nbr = 5,
        .pin_port = 1,
        .usic0_ch0_dx0 = USIC0_C0_DX0_P1_5,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA0,
        .eru1_input    = 0xA0,
        .pwm_ccu8_channel = 2
};

/**
 * P1_6
 */
static pin_io_function_t P1_6 = {
        .pin_nbr = 6,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_7
 */
static pin_io_function_t P1_7 = {
        .pin_nbr = 7,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_8
 */
static pin_io_function_t P1_8 = {
        .pin_nbr = 8,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 1,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_9
 */
static pin_io_function_t P1_9 = {
        .pin_nbr = 9,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P1_10
 */
static pin_io_function_t P1_10 = {
        .pin_nbr = 10,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P1_11
 */
static pin_io_function_t P1_11 = {
        .pin_nbr = 11,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 0,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P1_12
 */
static pin_io_function_t P1_12 = {
        .pin_nbr = 12,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P1_13
 */
static pin_io_function_t P1_13 = {
        .pin_nbr = 13,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P1_14
 */
static pin_io_function_t P1_14 = {
        .pin_nbr = 3,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P1_15
 */
static pin_io_function_t P1_15 = {
        .pin_nbr = 15,
        .pin_port = 1,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xA0,
        .pwm_ccu8_channel = 1
};

/**
 * P2_0
 */
static pin_io_function_t P2_0 = {
        .pin_nbr = 0,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB3,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P2_1
 */
static pin_io_function_t P2_1 = {
        .pin_nbr = 1,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xB0,
        .pwm_ccu8_channel = 1
};

/**
 * P2_2
 */
static pin_io_function_t P2_2 = {
        .pin_nbr = 2,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P2_3
 */
static pin_io_function_t P2_3 = {
        .pin_nbr = 3,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P2_4
 */
static pin_io_function_t P2_4 = {
        .pin_nbr = 4,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P2_5
 */
static pin_io_function_t P2_5 = {
        .pin_nbr = 5,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA2,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P2_6
 */
static pin_io_function_t P2_6 = {
        .pin_nbr = 6,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 4,
        .eru0_input    = 0xB3,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P2_7
 */
static pin_io_function_t P2_7 = {
        .pin_nbr = 7,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = 0xb0,
        .pwm_ccu8_channel = 2
};

/**
 * P2_8
 */
static pin_io_function_t P2_8 = {
        .pin_nbr = 8,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P2_9
 */
static pin_io_function_t P2_9 = {
        .pin_nbr = 0,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P2_10
 */
static pin_io_function_t P2_10 = {
        .pin_nbr = 10,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P2_11
 */
static pin_io_function_t P2_11 = {
        .pin_nbr = 11,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P2_12
 */
static pin_io_function_t P2_12 = {
        .pin_nbr = 12,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/**
 * P2_13
 */
static pin_io_function_t P2_13 = {
        .pin_nbr = 13,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P2_14
 */
static pin_io_function_t P2_14 = {
        .pin_nbr = 14,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P2_15
 */
static pin_io_function_t P2_15 = {
        .pin_nbr = 15,
        .pin_port = 2,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = USIC1_C0_DX0_P0_4,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 1
};

/**
 * P3_0
 */
static pin_io_function_t P3_0 = {
        .pin_nbr = 0,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_1
 */
static pin_io_function_t P3_1 = {
        .pin_nbr = 1,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xB1,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_2
 */
static pin_io_function_t P3_2 = {
        .pin_nbr = 2,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = 0xA1,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_3
 */
static pin_io_function_t P3_3 = {
        .pin_nbr = 3,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 1,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_4
 */
static pin_io_function_t P3_4 = {
        .pin_nbr = 4,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 2,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_5
 */
static pin_io_function_t P3_5 = {
        .pin_nbr = 5,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 3,
        .eru0_input    = 0xB1,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_6
 */
static pin_io_function_t P3_6 = {
        .pin_nbr = 6,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = 4,
        .eru0_input    = 0xA1,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_7
 */
static pin_io_function_t P3_7 = {
        .pin_nbr = 7,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_8
 */
static pin_io_function_t P3_8 = {
        .pin_nbr = 8,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_9
 */
static pin_io_function_t P3_9 = {
        .pin_nbr = 9,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_10
 */
static pin_io_function_t P3_10 = {
        .pin_nbr = 10,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_11
 */
static pin_io_function_t P3_11 = {
        .pin_nbr = 11,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_12
 */
static pin_io_function_t P3_12 = {
        .pin_nbr = 12,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_13
 */
static pin_io_function_t P3_13 = {
        .pin_nbr = 13,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_14
 */
static pin_io_function_t P3_14 = {
        .pin_nbr = 14,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P3_15
 */
static pin_io_function_t P3_15 = {
        .pin_nbr = 15,
        .pin_port = 3,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = NOT_SUPPORTED
};

/**
 * P5_0
 */
static pin_io_function_t P5_0 = {
        .pin_nbr = 0,
        .pin_port = 5,
        .usic0_ch0_dx0 = USIC0_C0_DX0_P5_0,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = USIC2_C0_DX0_P5_0,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

