ARMmbed/mbed-os/targets/TARGET_Infineon/TARGET_XMC4XXX/xmc4_helper.c
/*
 * P5_1
 */
static pin_io_function_t P5_1 = {
        .pin_nbr = 1,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/*
 * P5_2
 */
static pin_io_function_t P5_2 = {
        .pin_nbr = 2,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/*
 * P5_3
 */
static pin_io_function_t P5_3 = {
        .pin_nbr = 3,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/*
 * P5_4
 */
static pin_io_function_t P5_4 = {
        .pin_nbr = 4,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/*
 * P5_5
 */
static pin_io_function_t P5_5 = {
        .pin_nbr = 5,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/*
 * P5_6
 */
static pin_io_function_t P5_6 = {
        .pin_nbr = 6,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};

/*
 * P5_7
 */
static pin_io_function_t P5_7 = {
        .pin_nbr = 7,
        .pin_port = 5,
        .usic0_ch0_dx0 = NOT_SUPPORTED,
        .usic0_ch1_dx0 = NOT_SUPPORTED,
        .usic1_ch0_dx0 = NOT_SUPPORTED,
        .usic1_ch1_dx0 = NOT_SUPPORTED,
        .usic2_ch0_dx0 = NOT_SUPPORTED,
        .usic2_ch1_dx0 = NOT_SUPPORTED,
        .usic_select_line = NOT_SUPPORTED,
        .eru0_input    = NOT_SUPPORTED,
        .eru1_input    = NOT_SUPPORTED,
        .pwm_ccu8_channel = 2
};



/******************************************************* Pin function array **/
static pin_io_function_t *pinFunctions[] = {
        &P0_0,
        &P0_1,
        &P0_2,
        &P0_3,
        &P0_4,
        &P0_5,
        &P0_6,
        &P0_7,
        &P0_8,
        &P0_9,
        &P0_10,
        &P0_11,
        &P0_12,
        &P0_13,
        &P0_14,
        &P0_15,
        &P1_0,
        &P1_1,
        &P1_2,
        &P1_3,
        &P1_4,
        &P1_5,
        &P1_6,
        &P1_7,
        &P1_8,
        &P1_9,
        &P1_10,
        &P1_11,
        &P1_12,
        &P1_13,
        &P1_14,
        &P1_15,
        &P2_0,
        &P2_1,
        &P2_2,
        &P2_3,
        &P2_4,
        &P2_5,
        &P2_6,
        &P2_7,
        &P2_8,
        &P2_9,
        &P2_10,
        &P2_11,
        &P2_12,
        &P2_13,
        &P2_14,
        &P2_15,
        &P3_0,
        &P3_1,
        &P3_2,
        &P3_3,
        &P3_4,
        &P3_5,
        &P3_6,
        &P3_7,
        &P3_8,
        &P3_9,
        &P3_10,
        &P3_11,
        &P3_12,
        &P3_13,
        &P3_14,
        &P3_15,
        &P5_0,
        &P5_1,
        &P5_2,
        &P5_3,
        &P5_4,
        &P5_5,
        &P5_6,
        &P5_7
};

/**************************************************************** Functions **/

/**
 * @brief Get Pin functions of a specific PIN
 *
 * @param PinName (see PinNames.h)
 *
 * @return pointer to the pin function (see typedef pin_io_function_t)
 */
const pin_io_function_t *get_pin_function(uint32_t PinName){

    unsigned int i;
    uint8_t pin_port = (PinName & 0xF0) >> 4;
    uint8_t pin_nbr = XMC4_GET_PIN_NBR_FROM_NAME(PinName);
    pin_io_function_t *ptr = NULL;

    for(i=0; i<(sizeof(pinFunctions)/sizeof(pinFunctions[0])); i++){
        /* Get Pin Element */
        ptr = pinFunctions[i];
        if((ptr->pin_nbr == pin_nbr) && (ptr->pin_port == pin_port)){
            return ptr;
        }
    }

    /* Return NULL if no match was found */
    return NULL;
}

/*EOF*/
